/*
 ****************************************************************
 *								*
 *			ata.h					*
 *								*
 *	Definições acerca de dispositivos ATA			*
 *								*
 *	Versão	4.0.0, de 18.07.01				*
 *		4.9.0, de 26.04.07				*
 *								*
 *	Módulo: Núcleo						*
 *		NÚCLEO do TROPIX para PC			*
 *								*
 *	TROPIX: Sistema Operacional Tempo-Real Multiprocessado	*
 *		Copyright © 2007 NCE/UFRJ - tecle "man licença"	*
 *								*
 ****************************************************************
 */

#define	ATA_H

/*
 ****************************************************************
 *	Registradores e bits dos controladores			*
 ****************************************************************
 */
#define NATAC				16	/* Número máximo de canais */
#define NATAT				2	/* Cada canal comporta, no máximo, 2 dispositivos */

#define PL				3	/* Prioridade de interrupção */
#define	PATA_IRQ_BASE			14	/* IRQs 14 e 15 para PATA */

#define ATA_PRIMARY			0x1F0	/* Port do canal primário */
#define ATA_SECONDARY			0x170	/* Port do canal secundário */
#define ATA_ALTOFFSET			0x206	/* Deslocamento do registrador ATA_ALTSTAT */

#define	ATA_BMIOSIZE			8	/* Deslocamento do port do DMA para o canal secundário */

/*
 ******	Deslocamentos virtuais dos Registradores ****************
 */
enum
{
	ATA_DATA,		/* RW) data */
	ATA_FEATURE,		/* W) feature */
	ATA_COUNT,		/* W) sector count */
	ATA_SECTOR,		/* RW) sector # */
	ATA_CYL_LSB,		/* RW) cylinder# LSB */
	ATA_CYL_MSB,		/* RW) cylinder# MSB */

#define ATA_I82801IB_AH6        0x29228086
#define ATA_I82801IB_AH4        0x29238086
#define ATA_I82801IB_S2         0x29268086

/*
 ******	Valores para VIA ****************************************
 */
#define ATA_VIA_ID		0x1106
#define ATA_VIA82C571           0x05711106
#define ATA_VIA82C586           0x05861106
#define ATA_VIA82C596           0x05961106
#define ATA_VIA82C686           0x06861106
#define ATA_VIA8231             0x82311106
#define ATA_VIA8233             0x30741106
#define ATA_VIA8233A            0x31471106
#define ATA_VIA8233C            0x31091106
#define ATA_VIA8235             0x31771106
#define ATA_VIA8237             0x32271106
#define ATA_VIA8237A            0x05911106
#define ATA_VIA8251             0x33491106
#define ATA_VIA8361             0x31121106
#define ATA_VIA8363             0x03051106
#define ATA_VIA8371             0x03911106
#define ATA_VIA8662             0x31021106
#define ATA_VIA6410             0x31641106
#define ATA_VIA6420             0x31491106
#define ATA_VIA6421             0x32491106

/*
 ******	Valores para Sis ****************************************
 */
#define ATA_SIS_ID		0x1039
#define ATA_SISSOUTH            0x00081039
#define ATA_SIS5511             0x55111039
#define ATA_SIS5513             0x55131039
#define ATA_SIS5517             0x55171039
#define ATA_SIS5518             0x55181039
#define ATA_SIS5571             0x55711039
#define ATA_SIS5591             0x55911039
#define ATA_SIS5596             0x55961039
#define ATA_SIS5597             0x55971039
#define ATA_SIS5598             0x55981039
#define ATA_SIS5600             0x56001039
#define ATA_SIS530		0x05301039
#define ATA_SIS540		0x05401039
#define ATA_SIS550		0x05501039
#define ATA_SIS620		0x06201039
#define ATA_SIS630		0x06301039
#define ATA_SIS635		0x06351039
#define ATA_SIS633		0x06331039
#define ATA_SIS640		0x06401039
#define ATA_SIS645		0x06451039
#define ATA_SIS646		0x06461039
#define ATA_SIS648		0x06481039
#define ATA_SIS650		0x06501039
#define ATA_SIS651		0x06511039
#define ATA_SIS652		0x06521039
#define ATA_SIS655		0x06551039
#define ATA_SIS658		0x06581039
#define ATA_SIS661		0x06611039
#define ATA_SIS730		0x07301039
#define ATA_SIS733		0x07331039
#define ATA_SIS735		0x07351039
#define ATA_SIS740		0x07401039
#define ATA_SIS745		0x07451039
#define ATA_SIS746		0x07461039
#define ATA_SIS748		0x07481039
#define ATA_SIS750		0x07501039
#define ATA_SIS751		0x07511039
#define ATA_SIS752		0x07521039
#define ATA_SIS755		0x07551039
#define ATA_SIS961		0x09611039
#define ATA_SIS962		0x09621039
#define ATA_SIS963		0x09631039
#define ATA_SIS964		0x09641039
#define ATA_SIS965		0x09651039
#define ATA_SIS180		0x01801039
#define ATA_SIS181		0x01811039
#define ATA_SIS182		0x01821039

/*
 ******	Valores para Jmicron ************************************
 */
#define ATA_JMICRON_ID		0x197B
#define ATA_JMB360		0x2360197B
#define ATA_JMB361		0x2361197B
#define ATA_JMB363		0x2363197B
#define ATA_JMB365		0x2365197B
#define ATA_JMB366		0x2366197B
#define ATA_JMB368		0x2368197B

typedef struct
{
	ulong		ch_id;		/* Identificação: (DEV, VENDOR) */
	char		ch_rev;		/* Revisão */
	int		ch_cfg1;	/* Indicadores */
	int		ch_cfg2;	/* Mais indicadores */
	char		ch_max_dma;	/* DMA máximo suportado */
	char		*ch_nm;		/* Nome do chipset */

}	ATA_CHIP_ID;

/*
 ****** Valores para "ch_cfg1" **********************************
 */
#define	AHCI		1

#define VIA33           0
#define VIA66           1
#define VIA100          2
#define VIA133          3
#define AMDNVIDIA       4

#define AMDCABLE        0x0001
#define AMDBUG          0x0002
#define NVIDIA          0x0004
#define NV4             0x0010
#define NVQ             0x0020
#define VIACLK          0x0100
#define VIABUG          0x0200
#define VIABAR          0x0400
#define VIAAHCI         0x0800

#define SIIMEMIO        1
#define SIIINTR         0x01
#define SIISETCLK       0x02
#define SIIBUG          0x04
#define SII4CH          0x08

#define SIS_SOUTH       1
#define SISSATA         2
#define SIS133NEW       3
#define SIS133OLD       4
#define SIS100NEW       5
#define SIS100OLD       6
#define SIS66           7
#define SIS33           8

/*
 ****** Estrutura retornada pelo comando IDENTIFY ***************
 */
#define	NOATAPARAM	(ATA_PARAM *)0

typedef struct
{
/*000*/	ushort		packet_size	:2;	/* packet command size */

    	ushort		incomplete	:1;
    	ushort		:2;
    	ushort		drq_type	:2;	/* DRQ type */

    	ushort		removable	:1;	/* device is removable */
    	ushort		type		:5;	/* device type */

    	ushort		:2;
    	ushort		cmd_protocol	:1;	/* command protocol */

/*001*/	ushort		cylinders;		/* # of cylinders */
	ushort		reserved2;

/*003*/	ushort		heads;			/* # heads */
	ushort		obsolete4;
	ushort		obsolete5;

/*006*/	ushort		sectors;		/* # sectors/track */
/*007*/	ushort		vendor7[3];
/*010*/	char		serial[20];		/* serial number */
	ushort		retired20;
	ushort		retired21;
	ushort		obsolete22;

/*023*/	char		revision[8];		/* firmware revision */
/*027*/	char		model[40];		/* model name */

/*047*/	ushort		sectors_intr;		/* sectors per interrupt */

/*048*/	ushort		usedmovsd;		/* double word read/write? */

/*049*/	ushort		retired49:8;
	ushort		support_dma	:1;	/* DMA supported */
	ushort		support_lba	:1;	/* LBA supported */
	ushort		disable_iordy	:1;	/* IORDY may be disabled */
	ushort		support_iordy	:1;	/* IORDY supported */
	ushort		softreset	:1;	/* needs softreset when busy */
	ushort		stdby_ovlap	:1;	/* standby/overlap supported */
	ushort		support_queueing:1;	/* supports queuing overlap */
	ushort		support_idma	:1;	/* interleaved DMA supported */

/*050*/	ushort		device_stdby_min:1;
	ushort		:13;
	ushort		capability_one:1;
	ushort		capability_zero:1;

/*051*/	ushort		vendor51:8;
	ushort		retired_piomode:8;	/* PIO modes 0-2 */

/*052*/	ushort		vendor52:8;
	ushort		retired_dmamode:8;	/* DMA modes, not ATA-3 */

/*053*/	ushort		atavalid;		/* fields valid */

	ushort		obsolete54[5];

/*059*/	ushort		multi_count:8;
	ushort		multi_valid:1;
	ushort		:7;

/*060*/	ulong		lba_size;
	ushort		obsolete62;

/*063*/	ushort		mwdmamodes;		/* multiword DMA modes */ 
/*064*/	ushort		apiomodes;		/* advanced PIO modes */ 

/*065*/	ushort		mwdmamin;		/* min. M/W DMA time/word ns */
/*066*/	ushort		mwdmarec;		/* rec. M/W DMA time ns */
/*067*/	ushort		pioblind;		/* min. PIO cycle w/o flow */
/*068*/	ushort		pioiordy;		/* min. PIO cycle IORDY flow */
	ushort		reserved69;
	ushort		reserved70;
/*071*/	ushort		rlsovlap;		/* rel time (us) for overlap */
/*072*/	ushort		rlsservice;		/* rel time (us) for service */
	ushort		reserved73;
	ushort		reserved74;

/*075*/	ushort		queuelen:5;
	ushort		:11;

/*076*/	ushort		satacapabilities;
	ushort		reserved77;
/*078*/	ushort		satasupport;
/*079*/	ushort		sataenabled;
/*080*/	ushort		version_major;
/*081*/	ushort		version_minor;

	struct
	{
/*082/085*/	ushort	smart:1;
		ushort	security:1;
		ushort	removable:1;
		ushort	power_mngt:1;
		ushort	packet:1;
		ushort	write_cache:1;
		ushort	look_ahead:1;
		ushort	release_irq:1;
		ushort	service_irq:1;
		ushort	reset:1;
		ushort	protected:1;
		ushort	:1;
		ushort	write_buffer:1;
		ushort	read_buffer:1;
		ushort	nop:1;
		ushort	:1;

/*083/086*/	ushort	microcode:1;
		ushort	queued:1;
		ushort	cfa:1;
		ushort	apm:1;
		ushort	notify:1;
		ushort	standby:1;
		ushort	spinup:1;
		ushort	:1;
		ushort	max_security:1;
		ushort	auto_acoustic:1;
		ushort	address48:1;
		ushort	config_overlay:1;
		ushort	flush_cache:1;
		ushort	flush_cache48:1;
		ushort	support_one:1;
		ushort	support_zero:1;

/*084/087*/	ushort	smart_error_log:1;
		ushort	smart_self_test:1;
		ushort	media_serial_no:1;
		ushort	media_card_pass:1;
		ushort	streaming:1;
		ushort	logging:1;
		ushort	:8;
		ushort	extended_one:1;
		ushort	extended_zero:1;

	}	support, enabled;

/*088*/	ushort		udmamodes;		/* UltraDMA modes */
/*089*/	ushort		erase_time;
/*090*/	ushort		enhanced_erase_time;
/*091*/	ushort		apm_value;
/*092*/	ushort		master_passwd_revision;

/*093*/	ushort		hwres_master	:8;
	ushort		hwres_slave	:5;
	ushort		hwres_cblid	:1;
	ushort		hwres_valid	:2;

/*094*/	ushort		current_acoustic:8;
	ushort		vendor_acoustic:8;

/*095*/	ushort		stream_min_req_size;
/*096*/	ushort		stream_transfer_time;
/*097*/	ushort		stream_access_latency;
/*098*/	ulong		stream_granularity;
/*100*/	ushort		lba_size48_1;
	ushort		lba_size48_2;
	ushort		lba_size48_3;
	ushort		lba_size48_4;
	ushort		reserved104[23];
/*127*/	ushort		removable_status;
/*128*/	ushort		security_status;
	ushort		reserved129[31];
/*160*/	ushort		cfa_powermode1;
	ushort		reserved161[14];
/*176*/	ushort		media_serial[30];
	ushort		reserved206[49];
/*255*/	ushort		integrity;

}	ATA_PARAM;

/*
 ****************************************************************
 *	Complemento aos dados de um pedido			*
 ****************************************************************
 */
#define	NOATASCB	(ATA_SCB *)NULL

typedef struct atascb	ATA_SCB;

struct atascb
{
	int		scb_step;		/* Fase do pedido */
	int		scb_flags;		/* Indicadores (os mesmos de b_flags em BHEAD) */
	int		scb_max_pio_sz;		/* No. máximo de bytes que pode ser transferido */
	int		scb_result;		/* Resultado da operação */

	/*
	 *	Dados do pedido total
	 */
	daddr_t		scb_blkno;		/* No. de bloco */
	void		*scb_area;		/* Endereço da área */
	int		scb_count;		/* No. total de bytes a transferir */

	/*
	 *	Dados do fragmento corrente
	 */
	int		scb_bytes_requested;	/* No. de bytes requisitados  */
	int		scb_bytes_transferred;	/* No. de bytes efetivamente transferidos */

	/*
	 *	Para os dispositivos ATAPI apenas
	 */
	char		*scb_cmd;		/* Comando SCSI corrente */

